Tutorials-3.0.1/compressible/convDivNozzle/Transient/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 496.132;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        value           uniform 496.132;
        T0              uniform 500;
        U               U;
        phi             phi;
        psi		thermo:psi;
        gamma           1.4;
        
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type           zeroGradient;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
